package com.algo.day16;

/*
* 문제: 구독 서비스 정산하기
문제 설명

당신은 여러 구독 서비스를 한 번에 관리하는 앱을 만들고 있다.

사용자는 하루에 한 번씩 구독료 정산 내역을 기록한다.
각 날짜의 정산 금액은 정수 A[i]로 주어진다.

양수: 그날 추가로 결제한 금액
음수: 그날 환불받은 금액
0: 아무 일도 없음

앱은 사용자가 특정 기간을 조회했을 때, 그 기간의 총 정산 금액이 정확히 X원이 되는 경우를 찾으려고 한다.

단, 너무 짧은 기간은 의미가 없으므로 조회 기간의 길이는 최소 L일 이상이어야 한다.

전체 기록에서 다음 조건을 만족하는 연속 기간의 개수를 구하여라.

기간의 총 정산 금액이 정확히 X
기간의 길이가 L 이상
입력
N X L
A1 A2 A3 ... AN
출력

조건을 만족하는 연속 기간의 개수를 출력한다.

제한
1 ≤ N ≤ 500,000
-10^9 ≤ A[i] ≤ 10^9
-10^14 ≤ X ≤ 10^14
1 ≤ L ≤ N

정답은 64비트 정수 범위를 사용할 수 있다.

예제 입력
8 3 3
1 2 -1 2 1 -2 3 0
예제 출력
4
* */
public class Solution3 {
}
